мояработа/src/Documents/ЗакрытиеМесяца/ЗакрытиеМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеМесяца</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
</mdclass:Document>

мояработа/src/AccountingRegisters/РегистрБухУчет/РегистрБухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухУчет</name>
  <chartOfAccounts>ChartOfAccounts.БухУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

мояработа/src/ChartsOfAccounts/БухУчет/БухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухУчет</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41       </code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60       </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62       </code>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Себестоимость</description>
      <code>90.1     </code>
    </items>
    <items>
      <name>Выручка</name>
      <description>Выручка</description>
      <code>90.2     </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50       </code>
    </items>
    <items>
      <name>РасчетныеСчета</name>
      <description>Расчетные счета</description>
      <code>51       </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>99       </code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

мояработа/src/Documents/ЗакрытиеМесяца/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрБухУчетОстатки.РазвернутыйСчет,
		|	РегистрБухУчетОстатки.СуммаРазвернутыйОстатокДт,
		|	РегистрБухУчетОстатки.СуммаРазвернутыйОстатокКт,
		|ИЗ
		|	РегистрБухгалтерии.РегистрБухУчет.Остатки(&МоментВремени, РазвернутыйСчет В (&СчетВыручка, &СчетСебестоимость),) КАК
		|		РегистрБухУчетОстатки";
	
	Запрос.УстановитьПараметр("СчетВыручка", ПланыСчетов.БухУчет.Выручка);
	Запрос.УстановитьПараметр("МоментВремени", КонецМесяца(Дата)+1);
	Запрос.УстановитьПараметр("СчетСебестоимость", ПланыСчетов.БухУчет.Себестоимость);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаВыручки = 0;
	СуммаСебестоимости = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Если ВыборкаДетальныеЗаписи.РазвернутыйСчет = ПланыСчетов.БухУчет.Выручка Тогда
		СуммаВыручки = ВыборкаДетальныеЗаписи.СуммаРазвернутыйОстатокКт;
	ИначеЕсли ВыборкаДетальныеЗаписи.РазвернутыйСчет = ПланыСчетов.БухУчет.Себестоимость Тогда
		СуммаСебестоимости = ВыборкаДетальныеЗаписи.СуммаРазвернутыйОстатокДт;
		КонецЕсли;
	КонецЦикла;
	Движения.РегистрБухУчет.Записывать = Истина;
	Проводка = Движения.РегистрБухУчет.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчет.Выручка;
	Проводка.СчетКт = ПланыСчетов.БухУчет.ПрибылиИУбытки;
	Проводка.Сумма = СуммаВыручки;
	
	Проводка = Движения.РегистрБухУчет.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчет.ПрибылиИУбытки;
	Проводка.СчетКт = ПланыСчетов.БухУчет.Себестоимость;
	Проводка.Сумма = СуммаСебестоимости;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
